AnZ2G/GD32F450-Library-Demo/Demo/12_OLED_Screen_Hardware_SPI/oled.h
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//测试硬件：单片机STM32F429IGT6,正点原子Apollo STM32F4/F7开发板,主频180MHZ，晶振25MHZ
//QDtech-OLED液晶驱动 for STM32
//xiao冯@ShenZhen QDtech co.,LTD
//公司网站:www.qdtft.com
//淘宝网站：http://qdtech.taobao.com
//wiki技术网站：http://www.lcdwiki.com
//我司提供技术支持，任何技术问题欢迎随时交流学习
//固话(传真) :+86 0755-23594567 
//手机:15989313508（冯工） 
//邮箱:lcdwiki01@gmail.com    support@lcdwiki.com    goodtft@163.com
//技术支持QQ:3002773612  3002778157
//技术交流QQ群:324828016
//创建日期:2018/8/27
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 深圳市全动电子技术有限公司 2018-2028
//All rights reserved
/****************************************************************************************************
//=========================================电源接线================================================//
// OLED模块               STM32单片机
//   VCC         接       DC 5V/3.3V      //OLED屏电源正
//   GND         接          GND          //OLED屏电源地
//=======================================液晶屏数据线接线==========================================//
//本模块默认数据总线类型为4线制SPI
// OLED模块               STM32单片机
//   D1          接          PF9         //OLED屏SPI写信号
//=======================================液晶屏控制线接线==========================================//
// OLED模块               STM32单片机
//   CS          接          PD11        //OLED屏片选控制信号
//   RES         接          PD12        //OLED屏复位控制信号
//   DC          接          PD5         //OLED屏数据/命令选择控制信号
//   D0          接          PF7         //OLED屏SPI时钟信号
//=========================================触摸屏接线=========================================//
//本模块不带触摸功能，所以不需要触摸屏接线
****************************************************************************************************/	
/***************************************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, QD electronic SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
****************************************************************************************************/	
#ifndef __OLED_H
#define __OLED_H			  	 
#include "systick.h"
#include "gd32f4xx.h"
 
//--------------OLED参数定义---------------------
#define PAGE_SIZE    8
#define XLevelL		0x00
#define XLevelH		0x10
#define YLevel       0xB0
#define	Brightness	 0xFF 
#define WIDTH 	     128
#define HEIGHT 	     64	

//-------------写命令和数据定义-------------------
#define OLED_CMD     0	//写命令
#define OLED_DATA    1	//写数据 
   						  
//-----------------OLED端口定义----------------
//#define OLED_CS   GPIO_PIN_11   //片选信号           PD11
#define OLED_DC   GPIO_PIN_12   //数据/命令控制信号   PD5
#define OLED_RST  GPIO_PIN_14   //复位信号           PD12
#define OLED_SPI  SPI1

//-----------------OLED端口操作定义---------------- 
//#define OLED_CS_Clr()  HAL_GPIO_WritePin(GPIOD, OLED_CS, GPIO_PIN_RESET)
//#define OLED_CS_Set()  HAL_GPIO_WritePin(GPIOD, OLED_CS, GPIO_PIN_SET)

#define OLED_DC_Clr()  gpio_bit_write(GPIOB, OLED_DC, RESET)
#define OLED_DC_Set()  gpio_bit_write(GPIOB, OLED_DC, SET)
 					   
#define OLED_RST_Clr()  gpio_bit_write(GPIOB, OLED_RST, RESET)
#define OLED_RST_Set()  gpio_bit_write(GPIOB, OLED_RST, SET)
						 

//OLED控制用函数
void OLED_WR_Byte(unsigned dat,unsigned cmd);     							   		    
void OLED_Display_On(void);
void OLED_Display_Off(void);
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_Reset(void);
void OLED_Init_GPIO(void);	   							   		    
void OLED_Init(void);
void OLED_Set_Pixel(unsigned char x, unsigned char y,unsigned char color);
void OLED_Display(void);
void OLED_Clear(unsigned dat);  
void OLED_show_ascii(uint8_t ascii_buffer[16],uint8_t line_num);
void OLED_show_ascii_half(uint8_t ascii_buffer[16],uint8_t line_num);
void OLED_show_chinese(uint8_t chinese_buffer[32],uint8_t line_num);
#endif
